installation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-11-13 Thu 11:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mathematical Components: Installation</title>
<meta name="author" content="Reynald Affeldt" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Mathematical Components: Installation</h1>
<p>
The Mathematical Components libraries are provided as separate packages:
</p>

<ul class="org-ul">
<li>The base libraries are the libraries that support the formalization
of the Four Color Theorem and of the Odd Order Theorem.</li>

<li>Other libraries contain extensions and applications.</li>
</ul>

<p>
The installation of Mathematical Components is best done using <a href="https://opam.ocaml.org/">opam</a>, a
package manager for <a href="https://ocaml.org/">OCaml</a>, the programming language with which the
<a href="https://rocq-prover.org/">Rocq</a> prover is implemented.
</p>

<p>
The relevant packages can be found in the <a href="https://rocq-prover.org/packages">Rocq package index</a>;
their name is usually prefixed with <code>rocq-mathcomp-</code> or <code>coq-mathcomp-</code>.
</p>
<div id="outline-container-org3ac722b" class="outline-2">
<h2 id="org3ac722b">Install the Base Mathematical Components Libraries</h2>
<div class="outline-text-2" id="text-org3ac722b">
</div>
<div id="outline-container-org550b021" class="outline-3">
<h3 id="org550b021">Installation using the <a href="https://opam.ocaml.org/">opam</a> package manager</h3>
<div class="outline-text-3" id="text-org550b021">
<ul class="org-ul">
<li>Using opam, the installation of the base Mathematical Components
library is as simple as this:</li>
</ul>

<div class="org-src-container">
<pre class="src src-nil">opam repo add coq-released https://coq.inria.fr/opam/released
opam install coq-mathcomp-ssreflect
</pre>
</div>

<ul class="org-ul">
<li>Other base mathematical components libraries can then be installed
similarly using <code>opam install</code>:
<ul class="org-ul">
<li><code>coq-mathcomp-algebra</code>,</li>
<li><code>coq-mathcomp-field</code>,</li>
<li><code>coq-mathcomp-solvable</code>,</li>
<li><code>coq-mathcomp-fingroup</code>,</li>
<li><code>coq-mathcomp-character</code>.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge2a9eef" class="outline-3">
<h3 id="orge2a9eef">Installation using the <a href="https://github.com/rocq-prover/platform">Coq platform</a></h3>
<div class="outline-text-3" id="text-orge2a9eef">
<ul class="org-ul">
<li>The <a href="https://github.com/coq/platform">Coq platform</a> is a distribution of <a href="https://rocq-prover.org/">Rocq</a> together with a selection of libraries
including most Mathematical Components libraries. It supports Linux, macOS, and Windows.</li>
</ul>
</div>
</div>
<div id="outline-container-org352ce28" class="outline-3">
<h3 id="org352ce28">Other installation instructions and details</h3>
<div class="outline-text-3" id="text-org352ce28">
<ul class="org-ul">
<li>You can find more detailed installation instructions in <a href="https://github.com/math-comp/math-comp/blob/master/INSTALL.md">INSTALL.md</a>
(from the official distribution), this includes:
<ul class="org-ul">
<li>various ways of installing using <code>opam</code></li>
<li>installation from the source files (using <code>make</code>)</li>
<li>installation using nix</li>
</ul></li>

<li>Installation instructions in <a href="https://staff.aist.go.jp/reynald.affeldt/ssrcoq/install.html">Japanese, 日本語</a>
<ul class="org-ul">
<li>see「パッケージからの設定」for installation using <code>opam</code></li>
</ul></li>

<li>Advanced: Installation Instructions for Windows 11 using cygwin-opam or WSL
<ul class="org-ul">
<li>It is possible to install the Mathematical Components libraries on
Windows 11 using <a href="https://www.cygwin.com/">cygwin</a> together with the binary distribution of Coq
or together with <a href="https://fdopen.github.io/opam-repository-mingw/installation/">opam for Windows</a>, or with Windows Subsystem for
Linux, as explained for example <a href="https://github.com/affeldt-aist/mathcomp-install/blob/master/install-windows-en.org">here</a>.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1854027" class="outline-2">
<h2 id="org1854027">Install Other Mathematical Components Libraries</h2>
<div class="outline-text-2" id="text-org1854027">
<p>
There are several libraries that build on top of the base
Mathematical Components libraries, e.g.:
</p>

<p>
Extensions:
</p>

<ol class="org-ol">
<li><a href="https://github.com/math-comp/finmap">Finite sets, finite maps, multisets and generic sets</a>
<ul class="org-ul">
<li>Available as the opam package <code>coq-mathcomp-finmap</code></li>
</ul></li>
<li><a href="https://github.com/math-comp/multinomials">Multinomials for the Mathematical Components library</a>
<ul class="org-ul">
<li>Available as the opam package <code>coq-mathcomp-multinomials</code></li>
</ul></li>
<li><a href="https://github.com/math-comp/real-closed">Theorems for Real Closed Fields</a>
<ul class="org-ul">
<li>Available as the opam package <code>coq-mathcomp-real-closed</code></li>
</ul></li>
<li>A layer for classical reasoning (developed along <a href="https://github.com/math-comp/analysis">MathComp Analysis</a>)
<ul class="org-ul">
<li>Available as the opam package <code>coq-mathcomp-classical</code></li>
</ul></li>
<li><a href="https://github.com/math-comp/analysis">MathComp Analysis</a>
<ul class="org-ul">
<li>Available as the opam package <code>coq-mathcomp-analysis</code></li>
</ul></li>
</ol>

<p>
Applications:
</p>

<ol class="org-ol">
<li><a href="https://github.com/math-comp/fourcolor">The Four Color theorem</a>
<ul class="org-ul">
<li>Available as the opam package <code>coq-fourcolor</code></li>
</ul></li>
<li><a href="https://github.com/math-comp/odd-order">The Odd Order theorem</a>
<ul class="org-ul">
<li>Available as the opam package <code>coq-mathcomp-odd-order</code></li>
</ul></li>
<li><a href="https://github.com/math-comp/Abel">Abel-Ruffini theorem</a>
<ul class="org-ul">
<li>Available as the opam package <code>coq-mathcomp-abel</code></li>
</ul></li>
<li><a href="https://github.com/coq-community/apery">A formal proof of the irrationality of zeta(3), the Apéry constant</a>
<ul class="org-ul">
<li>Available as the opam package <code>coq-mathcomp-apery</code></li>
</ul></li>
</ol>

<p>
More libraries:
</p>
<ul class="org-ul">
<li>See the Mathematical Components' <a href="https://github.com/math-comp">github</a>.</li>
<li><a href="https://rocq-community.org/">rocq-community</a> also features a number of libraries using Mathematical Components.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
